#include "someassets.h"

const QString ABSTRACTS[200] = {
    QStringLiteral("六十余载风雨砥砺，六十余载春华秋实。明光之北、蓟门之南，古老的城墙，见证了永不消逝的电波；\
    鸿雁翱翔、银杏巍巍，坚实的土地，承载了信息黄埔的传奇。北京邮电大学是新中国第一所邮电高等学府，是教育部直属、工业和信息化\
    部共建的全国重点大学。"),
    QStringLiteral("清华大学（Tsinghua University）简称“清华”，坐落于北京市海淀区双清路30号 [154]，系中华人 …\
    清华大学的前身为始建于1911年的清华学堂，1912年更名为清华学校。1928年更名为国立清华大学。1937年抗日战争全面爆发后南迁长沙，\
    与北京大学、南开大学组建国立长沙临时大学，1938年迁至昆明改名为国立西南联合大学。"),
    QStringLiteral("北京大学是中国第一所国立综合性大学，创办之初为国家最高教育行政机关。 [146]创立于1898年维新变法之际，初名京\
    师大学堂。1912年改为国立北京大学。1938年迁至昆明，更名为国立西南联合大学。1946年返回北平。"),
    QStringLiteral("北京故宫（The Imperial Palace [88]）是中国明清两代的皇家宫殿，旧称紫禁城，位于北京中轴线的中心。故宫以三\
    大殿为中心，占地面积约72万平方米，建筑面积约15万平方米，有大小宫殿七十多座，相传故宫一共有9999.5间，实际据1973年专家现场测量故宫有房间8707间 [88]。"),
    QStringLiteral("长城修筑的历史可上溯到西周时期，发生在首都镐京（今陕西西安）的著名典故“烽火戏诸侯”就源于此 [1-6]。春秋战国时\
    期，列国争霸，互相防守，长城修筑进入第一个高潮，但此时修筑的长度都比较短。"),
    QStringLiteral("吃瓜会堂是什么玩意，这当然是我编的。"),
    QStringLiteral("南瓜西站是什么玩意，这当然是我编的。")
};
